In [3]:
import pandas as pd

In [4]:
transactions = pd.read_csv('Retail_Data_Transactions.csv')
response = pd.read_csv('Retail_Data_Response.csv')

transactions.head(), response.head()

(  customer_id trans_date  tran_amount
 0      CS5295  11-Feb-13           35
 1      CS4768  15-Mar-15           39
 2      CS2122  26-Feb-13           52
 3      CS1217  16-Nov-11           99
 4      CS1850  20-Nov-13           78,
   customer_id  response
 0      CS1112         0
 1      CS1113         0
 2      CS1114         1
 3      CS1115         1
 4      CS1116         1)

In [5]:
transactions.isnull().sum()
response.isnull().sum()

customer_id    0
response       0
dtype: int64

In [6]:
transactions = transactions.drop_duplicates()
response = response.drop_duplicates()

transactions = transactions.dropna()
response = response.dropna()

In [8]:
merged_data = pd.merge(transactions, response, on='customer_id', how='inner')
merged_data.head()

  customer_id trans_date  tran_amount  response
0      CS5295  11-Feb-13           35         1
1      CS4768  15-Mar-15           39         1
2      CS2122  26-Feb-13           52         0
3      CS1217  16-Nov-11           99         0
4      CS1850  20-Nov-13           78         0

In [21]:
merged_data['trans_date']= pd.to_datetime(merged_data['trans_date'])
merged_data['response']= merged_data['response'].astype('int64')
merged_data

       customer_id trans_date  tran_amount  response  Month  Year
0           CS5295 2013-02-11           35         1      2  2013
1           CS4768 2015-03-15           39         1      3  2015
2           CS2122 2013-02-26           52         0      2  2013
3           CS1217 2011-11-16           99         0     11  2011
4           CS1850 2013-11-20           78         0     11  2013
...            ...        ...          ...       ...    ...   ...
124958      CS8433 2011-06-26           64         0      6  2011
124959      CS7232 2014-08-19           38         0      8  2014
124960      CS8731 2014-11-28           42         0     11  2014
124961      CS8133 2013-12-14           13         0     12  2013
124962      CS7996 2014-12-13           36         0     12  2014

[124963 rows x 6 columns]

In [22]:
merged_data.to_csv('Cleaned_Retail_Data.csv', index=False)
print('cleaned dataset saved successfully')

cleaned dataset saved successfully

In [10]:
merged_data.isnull().sum()

customer_id    0
trans_date     0
tran_amount    0
response       0
dtype: int64

In [11]:
print('Null values:\n', merged_data.isnull().sum())

Null values:
 customer_id    0
trans_date     0
tran_amount    0
response       0
dtype: int64

In [12]:
print('\nDuplicate rows:', merged_data.duplicated().sum())

Duplicate rows: 0

In [13]:
print('\nData types:\n', merged_data.dtypes)

Data types:
 customer_id    object
trans_date     object
tran_amount     int64
response        int64
dtype: object

In [23]:
merged_data.head()

  customer_id trans_date  tran_amount  response  Month  Year
0      CS5295 2013-02-11           35         1      2  2013
1      CS4768 2015-03-15           39         1      3  2015
2      CS2122 2013-02-26           52         0      2  2013
3      CS1217 2011-11-16           99         0     11  2011
4      CS1850 2013-11-20           78         0     11  2013

In [26]:
import pandas as pd

# Load your cleaned data again
data = pd.read_csv("Cleaned_Retail_Data.csv")

# Ensure trans_date is in datetime format
data['trans_date'] = pd.to_datetime(data['trans_date'], errors='coerce')

# Extract Month and Year correctly
data['Month'] = data['trans_date'].dt.month
data['Year'] = data['trans_date'].dt.year

# Verify
print(data[['trans_date', 'Month', 'Year']])

       trans_date  Month  Year
0      2013-02-11      2  2013
1      2015-03-15      3  2015
2      2013-02-26      2  2013
3      2011-11-16     11  2011
4      2013-11-20     11  2013
...           ...    ...   ...
124958 2011-06-26      6  2011
124959 2014-08-19      8  2014
124960 2014-11-28     11  2014
124961 2013-12-14     12  2013
124962 2014-12-13     12  2014

[124963 rows x 3 columns]

In [27]:
monthly_sales = data.groupby('Month')['tran_amount'].sum().reset_index()
monthly_sales.columns = ['Month', 'Total_Sales']
print(monthly_sales)

    Month  Total_Sales
0       1       724089
1       2       644988
2       3       636400
3       4       515746
4       5       633162
5       6       697014
6       7       716995
7       8       726775
8       9       694134
9      10       725010
10     11       698024
11     12       709725

In [28]:
data.to_csv("Cleaned_Retail_Data.csv", index=False)